MyHome/src/InformationRegisters/ДанныеСеансовИнформационнойБазы/ДанныеСеансовИнформационнойБазы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеСеансовИнформационнойБазы</name>
  <resources>
    <name>ДатаНачалаСеанса</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>НомерСоединения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИспользуетсяПолнофункциональныйИнтерфейс</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользуетсяМобильныйИнтерфейс</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>НомерСеанса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

MyHome/src/CommonModules/ПользователиПовтИсп/Module.bsl
#Область ПрограммныйИнтерфейс

Функция НомерТекущегоСеанса() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Возврат ПараметрыСеанса.НомерСеанса;
	
КонецФункции

Функция ДанныеТекущегоСеанса(Знач НомерСеанса = Неопределено) Экспорт
	
	Если НомерСеанса = Неопределено Тогда
		НомерСеанса = НомерТекущегоСеанса();
	КонецЕсли;
	
	Возврат РегистрыСведений.ДанныеСеансовИнформационнойБазы.ДанныеСеанса(НомерСеанса);
	
КонецФункции

Функция ИспользуетсяМобильныйИнтерфейс(Знач НомерСеанса = Неопределено) Экспорт
	
	Если НомерСеанса = Неопределено Тогда
		НомерСеанса = НомерТекущегоСеанса();
	КонецЕсли;
		
	ДанныеСеанса = ДанныеТекущегоСеанса(НомерСеанса);
	
	ТипБулево = Новый ОписаниеТипов("Булево");
	
	ИспользуетсяМобильныйИнтерфейс = ТипБулево.ПривестиЗначение(ДанныеСеанса.ИспользуетсяМобильныйИнтерфейс);
	
	Возврат ИспользуетсяМобильныйИнтерфейс;	
	
КонецФункции

#КонецОбласти
